000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/АннуляцияПродажи/АннуляцияПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АннуляцияПродажи</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </resources>
  <resources>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </resources>
  <resources>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </resources>
  <resources>
    <name>СтатусЧекаККМ</name>
    <type>
      <types>EnumRef.СтатусыЧековККМ</types>
    </type>
  </resources>
  <resources>
    <name>Продавец</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Администратор</name>
    <comment>Признак наличия роли &quot;Администраторсистемы&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Компьютер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементСтруктуры</name>
    <type>
      <types>CatalogRef.СтруктураУзлов</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.ЧекККМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Индекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/АннуляцияПродажи/RecordSetModule.bsl
//	LNK 28.05.2019 10:44:17
Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

//	---------------------------------------------------------------------------------------

	Индекс = 0;

	Для каждого ЗаписьНабора Из ЭтотОбъект Цикл

		ЗаписьНабора.Период = Отбор.Период.Значение;

		Если НЕ Отбор.Индекс.Использование Тогда

				ЗаписьНабора.Индекс	= Индекс;

		Иначе	ЗаписьНабора.Индекс	= Отбор.Индекс.Значение;

		КонецЕсли;

		Если ЗаписьНабора.Магазин.Пустая() Тогда

			ЗаписьНабора.Магазин = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин;

		КонецЕсли;

		Если ЗаписьНабора.Продавец.Пустая() Тогда

			ЗаписьНабора.Продавец = Пользователи.АвторизованныйПользователь();

		КонецЕсли;

		Если ПустаяСтрока(ЗаписьНабора.Компьютер) Тогда

			ЗаписьНабора.Компьютер = ИмяКомпьютера();

		КонецЕсли;

		Если ЗаписьНабора.ЭлементСтруктуры.Пустая() Тогда

			Если ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Свойство("ЭлементСтруктуры") Тогда

				ЗаписьНабора.ЭлементСтруктуры = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().ЭлементСтруктуры;

			КонецЕсли;

		КонецЕсли;

		Индекс = Индекс + 1;

	КонецЦикла;

КонецПроцедуры
